ra-rs/ra/svd/vendor/R7FA8E1AF.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SYSC</name>
            <description>System Control</description>
            <baseAddress>0x4001E000</baseAddress>
            <addressBlock>
                <offset>0x20</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x26</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x32</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x36</offset>
                <size>7</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3E</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x43</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x48</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x54</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x61</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6C</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x74</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x7C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA2</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xCC</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE0</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3B0</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3B4</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3C0</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3E0</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3FA</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x400</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x402</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA0C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA10</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA14</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA18</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA1C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA20</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA24</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA28</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA2C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA30</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA38</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA40</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA44</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA50</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA54</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA58</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA70</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA84</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA88</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA90</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA98</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xAB0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xAD0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xAD8</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB0C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB20</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC40</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC45</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC48</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC4C</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD00</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SCKDIVCR</name>
                    <description>System Clock Division Control Register</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PCKD</name>
                            <description>Peripheral Module Clock D (PCLKD) Select</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>x 1/1</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>x 1/2</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>x 1/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>x 1/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>x 1/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>x 1/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>x 1/64</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>x 1/3</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>x 1/6</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>x 1/12</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCKC</name>
                            <description>Peripheral Module Clock C (PCLKC) Select</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>x 1/1</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>x 1/2</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>x 1/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>x 1/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>x 1/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>x 1/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>x 1/64</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>x 1/3</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>x 1/6</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>x 1/12</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCKB</name>
                            <description>Peripheral Module Clock B (PCLKB) Select</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>x 1/1</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>x 1/2</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>x 1/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>x 1/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>x 1/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>x 1/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>x 1/64</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>x 1/3</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>x 1/6</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>x 1/12</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCKA</name>
                            <description>Peripheral Module Clock A (PCLKA) Select</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>x 1/1</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>x 1/2</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>x 1/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>x 1/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>x 1/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>x 1/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
