ra-rs/ra/svd/vendor/R7FA8E1AF.svd
                <register>
                    <name>GTADSMR</name>
                    <description>General PWM Timer A/D Conversion Start Request Signal Monitoring Register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADSMS0</name>
                            <description>A/D Conversion Start Request Signal Monitor 0 Selection</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>A/D conversion start request signal generated by the GTADTRA register during up-counting.</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>A/D conversion start request signal generated by the GTADTRA register during down-counting.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>A/D conversion start request signal generated by the GTADTRB register during up-counting.</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>A/D conversion start request signal generated by the GTADTRB register during down-counting.</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADSMEN0</name>
                            <description>A/D Conversion Start Request Signal Monitor 0 Output Enabling</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Output of A/D conversion start request signal monitor 0 is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output of A/D conversion start request signal monitor 0 is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADSMS1</name>
                            <description>A/D Conversion Start Request Signal Monitor 1 Selection</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>A/D conversion start request signal generated by the GTADTRA register during up-counting.</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>A/D conversion start request signal generated by the GTADTRA register during down-counting.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>A/D conversion start request signal generated by the GTADTRB register during up-counting.</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>A/D conversion start request signal generated by the GTADTRB register during down-counting.</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADSMEN1</name>
                            <description>A/D Conversion Start Request Signal Monitor 1 Output Enabling</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Output of A/D conversion start request signal monitor 1 is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output of A/D conversion start request signal monitor 1 is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
