ra-rs/ra/svd/vendor/R7FA8E1AF.svd
                <register>
                    <name>CAMOR</name>
                    <description>Capture Interface Offset Register</description>
                    <addressOffset>0x0010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HOFST</name>
                            <description>Specify the capture start location in terms of the number of clock cycles from a horizontal sync signal (1-cycle units).</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VOFST</name>
                            <description>Specify the capture start location in terms of the HD count from a vertical sync signal (1-HD units).</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAPWR</name>
                    <description>Capture Interface Width Register</description>
                    <addressOffset>0x0014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HWDTH</name>
                            <description>Specify the horizontal capture period.</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VWDTH</name>
                            <description>Specify the vertical capture period (4-HD units).</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAIFR</name>
                    <description>Capture Interface Input Format Register</description>
                    <addressOffset>0x0018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FCI</name>
                            <description>Set the timing to start capturing.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Capture starts from the VD input immediately after the CEU activation regardless of it being a top or bottom field </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>After the CEU activation, input of a top-field image is waited, and then capture starts from the top field </description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>After the CEU activation, input of a bottom-field image is waited, and then capture starts from the bottom field </description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CIM</name>
                            <description>Sets the images to be captured.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Capture of frame image (1 VD) or both-field image (2 VD)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Capture of one-field image (1 VD)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFS</name>
                            <description>Sets the input mode for capturing images.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Progressive</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Interlace</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCNTR</name>
                    <description>CEU Register Control Register</description>
                    <addressOffset>0x0028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RC</name>
                            <description>Specifies switching of the register plane used by the CEU in synchronization with VD.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Uses the specified register plane in synchronization with VD</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Switches the register plane in synchronization with VD</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RS</name>
                            <description>Specifies which register plane is used by the CEU in synchronization with VD.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Uses plane A of the register</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Uses plane B of the register</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RVS</name>
                            <description>Sets the timing to switch the register plane in both-field capture.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Switches the register plane every 2 VD</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Switches the register plane every 1 VD</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCMPR</name>
                    <description>CEU Register Forcible Control Register</description>
                    <addressOffset>0x002C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RA</name>
                            <description>Indicates the register plane currently specified.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Specifies plane A of the register</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Specifies plane B of the register</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFLCR</name>
                    <description>Capture Filter Control Register</description>
                    <addressOffset>0x0030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HFRAC</name>
                            <description>Fraction Part of Horizontal Scale-Down Factor</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HMANT</name>
                            <description>Mantissa Part of Horizontal Scale-Down Factor</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VFRAC</name>
                            <description>Fraction Part of Vertical Scale-Down Factor</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VMANT</name>
                            <description>Mantissa Part of Vertical Scale-Down Factor</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFSZR</name>
                    <description>Capture Filter Size Clip Register</description>
                    <addressOffset>0x0034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HFCLP</name>
                            <description>Specify the horizontal clipping value of the filter output size (8-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VFCLP</name>
                            <description>Specify the vertical clipping value of the filter output size (4-pixel units).</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDWDR</name>
                    <description>Capture Destination Width Register</description>
                    <addressOffset>0x0038</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CHDW</name>
                            <description>Specify the horizontal image size in the memory area where the captured image is to be stored (8-byte units).</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDAYR</name>
                    <description>Capture Data Address Y Register</description>
                    <addressOffset>0x003C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CAYR</name>
                            <description>Capture Data Address Y</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDACR</name>
                    <description>Capture Data Address C Register</description>
                    <addressOffset>0x0040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CACR</name>
                            <description>Capture Data Address C</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDBYR</name>
                    <description>Capture Data Bottom-Field Address Y Register</description>
                    <addressOffset>0x0044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBYR</name>
                            <description>Set the address for storing the luminance component data of the captured bottom-field data (8-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDBCR</name>
                    <description>Capture Data Bottom-Field Address C Register</description>
                    <addressOffset>0x0048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBCR</name>
                            <description>Set the address for storing the chrominance component data of the captured bottom-field data (8-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CBDSR</name>
                    <description>Capture Bundle Destination Size Register</description>
                    <addressOffset>0x004C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBVS</name>
                            <description>Select the number of lines or number of bytes for output to the memory in a bundle write.</description>
                            <lsb>0</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFWCR</name>
                    <description>Firewall Operation Control Register</description>
                    <addressOffset>0x005C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000100</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FWE</name>
                            <description>Firewall Operation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Firewall is not activated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Firewall is activated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FWV</name>
                            <description>Specify the upper limit of a write address.</description>
                            <lsb>5</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
