ra-rs/ra/svd/vendor/R7FA8E1AF.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC01_NS</name>
            <description>Direct memory access controller 1</description>
            <baseAddress>0x5000A040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC02_NS</name>
            <description>Direct memory access controller 2</description>
            <baseAddress>0x5000A080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC03_NS</name>
            <description>Direct memory access controller 3</description>
            <baseAddress>0x5000A0C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC04_NS</name>
            <description>Direct memory access controller 4</description>
            <baseAddress>0x5000A100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC05_NS</name>
            <description>Direct memory access controller 5</description>
            <baseAddress>0x5000A140</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC06_NS</name>
            <description>Direct memory access controller 6</description>
            <baseAddress>0x5000A180</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC00_NS">
            <name>DMAC07_NS</name>
            <description>Direct memory access controller 7</description>
            <baseAddress>0x5000A1C0</baseAddress>
        </peripheral>
        <peripheral>
            <name>DMA0_NS</name>
            <description>DMAC Module Activation 0</description>
            <baseAddress>0x5000A800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DMAST</name>
                    <description>DMA Module Activation Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DMST</name>
                            <description>DMAC Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DMAC activation is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DMAC activation is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMECHR</name>
                    <description>DMAC Error Channel Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DMECH</name>
                            <description>DMAC Error channel</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMECHSAM</name>
                            <description>DMAC Error channel Security Attribution Monitor</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>secure channel</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>non-secure channel</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMESTA</name>
                            <description>DMAC Error Status</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No DMA transfer error occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DMA transfer error occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>DELSR%s</name>
                    <description>DMAC Event Link Setting Register %s</description>
                    <addressOffset>0x080</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DELS</name>
                            <description>DMAC Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>Disable interrupts to the associated DMAC module</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Event signal number to be linked. For details, see Table x.x Event table.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IR</name>
                            <description>DMAC Activation Request Status flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No DMAC activation request occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DMAC activation request occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
