ra-rs/ra/svd/vendor/R7FA8E1AF.svd
                <register>
                    <name>SPSR</name>
                    <description>SPI Status Register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x20000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SPCP</name>
                            <description>SPI Command Pointer</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>SPCMD0</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>SPCMD1</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>SPCMD2</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>SPCMD3</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>SPCMD4</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>SPCMD5</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>SPCMD6</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>SPCMD7</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPECM</name>
                            <description>SPI Error Command</description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>SPCMD0</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>SPCMD1</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>SPCMD2</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>SPCMD3</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>SPCMD4</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>SPCMD5</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>SPCMD6</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>SPCMD7</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPDRF</name>
                            <description>SPI Receive Data Ready Flag</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Receive data ready not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Receive data ready detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OVRF</name>
                            <description>Overrun Error Flag</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No overrun error is present.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An overrun error is present.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IDLNF</name>
                            <description>SPI Idle Flag</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The SPI is in the idle state.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The SPI is in the transfer state.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MODF</name>
                            <description>Mode Fault Error Flag</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Neither mode fault error nor underrun error is present.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A mode fault error or underrun error is present.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PERF</name>
                            <description>Parity Error Flag</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No parity error is present.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A parity error is present.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>UDRF</name>
                            <description>Underrun Error Flag</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When MODF=0, neither mode fault error nor underrun error is present. When MODF=1, a mode fault error is present. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When MODF=0, neither mode fault error nor underrun error is present. When MODF=1, an underrun error is present. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPTEF</name>
                            <description>SPI Transmit Buffer Empty Flag</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The number of empty stages in the transmit FIFO ≤ the value set in SPDCR2.TTRG</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The number of empty stages in the transmit FIFO &gt; the value set in SPDCR2.TTRG</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CENDF</name>
                            <description>Communication End Flag</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The SPI is not communicating or communicating.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The SPI communication completed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPRF</name>
                            <description>SPI Receive Buffer Full Flag</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The number of data stored in the receive FIFO ≤ number of frames set by the SPDCR2.RTRG bit.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The number of data stored in the receive FIFO &gt; number of frames set by the SPDCR2.RTRG bit.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPTFSR</name>
                    <description>SPI Transfer FIFO Status Register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TFDN</name>
                            <description>Transmit FIFO data empty stage number</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPRFSR</name>
                    <description>SPI Receive FIFO Status Register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000004</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDN</name>
                            <description>Receive FIFO data store stage number</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPPSR</name>
                    <description>SPI Polling Register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SPEPS</name>
                            <description>SPI Polling Status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>SPCR.SPE is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>SPCR.SPE is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPSRC</name>
                    <description>SPI Status Clear Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SPDRFC</name>
                            <description>SPI Receive Data Ready Flag Clear</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OVRFC</name>
                            <description>Overrun Error Flag Clear</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MODFC</name>
                            <description>Mode Fault Error Flag Clear</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PERFC</name>
                            <description>Parity Error Flag Clear</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>UDRFC</name>
                            <description>Underrun Error Flag Clear</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SPTEFC</name>
                            <description>SPI Transmit Buffer Empty Flag Clear</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CENDFC</name>
                            <description>Communication End Flag Clear</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SPRFC</name>
                            <description>SPI Receive Buffer Full Flag Clear</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPFCR</name>
                    <description>SPI FIFO Clear Register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SPFRST</name>
                            <description>SPI FIFO clear</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
